Revit 2027 API
NumberingSchema.SetMatchingParameters Method
 Sets the parameters used by a specific numbering schema for matching elements so they would get the same number.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetMatchingParameters(
	ISet<NumberingParameter> matchingParameters
)
Public Sub SetMatchingParameters (
	matchingParameters As ISet(Of NumberingParameter)
)
public:
void SetMatchingParameters(
	ISet<NumberingParameter^>^ matchingParameters
)
member SetMatchingParameters :
        matchingParameters : ISet<NumberingParameter> -> unit
Parameters
matchingParameters ISet<NumberingParameter>
 Parameters used to determine which elements are assigned the same number.
Exceptions
Exception | Condition
ArgumentException |  The input parameters are not valid for use in matching for numbering.
ArgumentNullException |  A non-optional argument was null
Remarks
 This method makes sure that the document will be consistent when it comes to numbering before it exits.
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace